In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

In [2]:
#dictionary
data={
    'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']
}
data

{'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
 'Age': [27, 24, 22, 32],
 'Address': ['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
 'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

# cols

In [3]:
# convert dictionary to dataframe
df=pd.DataFrame(data)
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [4]:
df.columns

Index(['Name', 'Age', 'Address', 'Qualification'], dtype='object')

In [5]:
#selecting 2 cols
d1= df[['Name','Address']]
d1

     Name    Address
0     Jai      Delhi
1  Princi     Kanpur
2  Gaurav  Allahabad
3    Anuj    Kannauj

In [6]:
#select multiple cols 
df[df.columns[0:3]]  #does not take last col

     Name  Age    Address
0     Jai   27      Delhi
1  Princi   24     Kanpur
2  Gaurav   22  Allahabad
3    Anuj   32    Kannauj

In [7]:
#column addition
#first declare a list then needed to add as col
rank=[10,11,12,13]
df.insert(4,"Pincode",[10,11,12,13], True)
df

     Name  Age    Address Qualification  Pincode
0     Jai   27      Delhi           Msc       10
1  Princi   24     Kanpur            MA       11
2  Gaurav   22  Allahabad           MCA       12
3    Anuj   32    Kannauj           Phd       13

In [8]:
d2=df.rename(columns={'Pincode': 'IP'}) #rename cols
d2

     Name  Age    Address Qualification  IP
0     Jai   27      Delhi           Msc  10
1  Princi   24     Kanpur            MA  11
2  Gaurav   22  Allahabad           MCA  12
3    Anuj   32    Kannauj           Phd  13

In [9]:
d2.drop('IP',axis=1,inplace=True)  #axis=1 removes cols , axis=0 removes rows, inplace = true removes permanently
d2

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [10]:
ID={"Jai":1333, "Princi": 1888, "Gaurav":9999, "Anuj":3456}

d2["ID"]=id
d2

     Name  Age    Address Qualification                      ID
0     Jai   27      Delhi           Msc  <built-in function id>
1  Princi   24     Kanpur            MA  <built-in function id>
2  Gaurav   22  Allahabad           MCA  <built-in function id>
3    Anuj   32    Kannauj           Phd  <built-in function id>

# rows

In [11]:
row={
    'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']
}
row

{'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
 'Age': [27, 24, 22, 32],
 'Address': ['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
 'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

In [12]:
df1=pd.DataFrame(row)
df1

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [13]:
# #drop a row
df1.drop([1], axis=0, inplace=True)
df1

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [14]:
for index, rows in df.iterrows():
    print(index,rows)  #gives all the data
# for index, rows in df.iterrows():   gives only 2 as specified
#     print(index,rows[["Age","Address"]])

0 Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Pincode             10
Name: 0, dtype: object
1 Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Pincode              11
Name: 1, dtype: object
2 Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Pincode                 12
Name: 2, dtype: object
3 Name                Anuj
Age                   32
Address          Kannauj
Qualification        Phd
Pincode               13
Name: 3, dtype: object

In [15]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, Name='Jai', Age=27, Address='Delhi', Qualification='Msc', Pincode=10)
Pandas(Index=1, Name='Princi', Age=24, Address='Kanpur', Qualification='MA', Pincode=11)
Pandas(Index=2, Name='Gaurav', Age=22, Address='Allahabad', Qualification='MCA', Pincode=12)
Pandas(Index=3, Name='Anuj', Age=32, Address='Kannauj', Qualification='Phd', Pincode=13)

In [16]:
for label, content in df.iteritems():
    print(label, content)

Name 0       Jai
1    Princi
2    Gaurav
3      Anuj
Name: Name, dtype: object
Age 0    27
1    24
2    22
3    32
Name: Age, dtype: int64
Address 0        Delhi
1       Kanpur
2    Allahabad
3      Kannauj
Name: Address, dtype: object
Qualification 0    Msc
1     MA
2    MCA
3    Phd
Name: Qualification, dtype: object
Pincode 0    10
1    11
2    12
3    13
Name: Pincode, dtype: int64

In [23]:
df1

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [24]:
df2=df1.loc["Gaurav":"Anuj"] #displays data bw two indexes
df2

Empty DataFrame
Columns: [Name, Age, Address, Qualification]
Index: []